# Terraform `environment` `prod`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPWE2ZTllZTdkLTJiNjUtNDFlMS1hZGZiLTBjOGMyMzUxNWNmOTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_role_assignment.altinncr_writer_broker must be replaced
-/+ resource "azurerm_role_assignment" "altinncr_writer_broker" {
      ~ condition                              = <<-EOT # forces replacement
            (
             (
              !(ActionMatches{'Microsoft.ContainerRegistry/registries/repositories/content/write'})
              AND
              !(ActionMatches{'Microsoft.ContainerRegistry/registries/repositories/content/read'})
              AND
              !(ActionMatches{'Microsoft.ContainerRegistry/registries/repositories/metadata/read'})
              AND
              !(ActionMatches{'Microsoft.ContainerRegistry/registries/repositories/metadata/write'})
             )
             OR 
             (
          -   @Request[Microsoft.ContainerRegistry/registries/repositories:name] StringLike 'corr'
          +   @Request[Microsoft.ContainerRegistry/registries/repositories:name] StringStartsWith 'corr'
             )
            )
        EOT
      ~ condition_version                      = "2.0" -> (known after apply)
      ~ id                                     = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr/providers/Microsoft.Authorization/roleAssignments/6c6eb834-090d-b3fd-7f22-79607e1ad6d8" -> (known after apply)
      ~ name                                   = "6c6eb834-090d-b3fd-7f22-79607e1ad6d8" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/providers/Microsoft.Authorization/roleDefinitions/2a1e307c-b015-4ebd-883e-5b7698a07328" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.altinncr_writer_corr must be replaced
-/+ resource "azurerm_role_assignment" "altinncr_writer_corr" {
      ~ condition                              = <<-EOT # forces replacement
            (
             (
              !(ActionMatches{'Microsoft.ContainerRegistry/registries/repositories/content/write'})
              AND
              !(ActionMatches{'Microsoft.ContainerRegistry/registries/repositories/content/read'})
              AND
              !(ActionMatches{'Microsoft.ContainerRegistry/registries/repositories/metadata/read'})
              AND
              !(ActionMatches{'Microsoft.ContainerRegistry/registries/repositories/metadata/write'})
             )
             OR 
             (
              @Request[Microsoft.ContainerRegistry/registries/repositories:name] StringStartsWith 'corr'
             )
            )
        EOT
      ~ condition_version                      = "2.0" -> (known after apply)
      ~ id                                     = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr/providers/Microsoft.Authorization/roleAssignments/0ef2c743-59b1-3319-99b4-1cc416492e32" -> (known after apply)
      ~ name                                   = "0ef2c743-59b1-3319-99b4-1cc416492e32" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/providers/Microsoft.Authorization/roleDefinitions/2a1e307c-b015-4ebd-883e-5b7698a07328" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.altinncr_writer_corr_test will be created
  + resource "azurerm_role_assignment" "altinncr_writer_corr_test" {
      + condition                        = <<-EOT
            (
             (
              !(ActionMatches{'Microsoft.ContainerRegistry/registries/repositories/content/write'})
              AND
              !(ActionMatches{'Microsoft.ContainerRegistry/registries/repositories/content/read'})
              AND
              !(ActionMatches{'Microsoft.ContainerRegistry/registries/repositories/metadata/read'})
              AND
              !(ActionMatches{'Microsoft.ContainerRegistry/registries/repositories/metadata/write'})
             )
             OR 
             (
              @Request[Microsoft.ContainerRegistry/registries/repositories:name] StringStartsWith 'corr'
             )
            )
        EOT
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ec40031a-d620-4313-a10b-ac2fb329281e"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Container Registry Repository Writer"
      + scope                            = "/subscriptions/a6e9ee7d-2b65-41e1-adfb-0c8c23515cf9/resourceGroups/acr/providers/Microsoft.ContainerRegistry/registries/altinncr"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @bengtfredh |
| Action | `push` |
| Working Directory | `./infrastructure/adminservices-prod/altinncr` |
| State File | `github.com/altinn/altinn-platform/environments/prod/altinncr.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_prod_altinncr.tfstate.tfplan` |